# ONLINE REASONS

In [1]:
#There are a lot of reasons to choose pandas, some of them are

# Open Source
# Easy to Learn
# Great Community
# Built on Top of Numpy
# Easy to Analyze and pre-process data in it
# Built-in Data Visualization
# A lot of Built-in functions to help in Exploratory Data Analysis
# Built-in support for CSV, SQL, HTML, JSON, pickle, excel, clipboard and a lot more
# and a lot more

In [2]:
# #Pandas is an open source Python library that allows the handling of tabular data (i.e. explore, clean and process). 
# The term originated from the econometrics term panel data and thus 
# PAN(el)-DA(ta)-S.

# # At a high-level, Pandas works very much like a spreadsheet 
# (i.e. think Microsoft Excel or Google Sheets) as you work with rows and columns. 
# Pandas serves as one of the pillar libraries of any data science workflow as it allows you to perform processing, 
# wrangling and munging of data. This is particularly important as many consider the data pre-processing stage 
# to occupy as much as 80% of a data scientistâ€™s time.

In [3]:
#  The two primary data structures are Series which is 1 dimensional and DataFrame which is 2 dimensional.

In [4]:
# SYLLABUS HOSE UDEMY

In [5]:
# Series
# DataFrames
# Missing Data
# GroupBy
# Merging,Joining,and Concatenating
# Operations
# Data Input and Output

# Series

In [6]:
# built on top of numpy array
#  can be accesed by lables

In [7]:
import numpy as np
import pandas as pd

In [144]:
# using basic datatypes for craeting a series in pandas

In [151]:
labels = ['a','b','c']
mydata = [10,20,30]

In [152]:
arr =  np.array(mydata)

In [153]:
d  = {'a':10,'b':20,'c':30}

In [154]:
# creating a series using a list
pd.Series(data=mydata)

0    10
1    20
2    30
dtype: int64

In [10]:
#changing default labels to our custom labels
pd.Series(data=mydata,index=labels)

a    10
b    20
c    30
dtype: int64

In [11]:
# creating a series using array
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [12]:
# creating a series using dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [156]:
# accesing the data using index
s1 = pd.Series([1,2,3,4,],['usa','ger','ussr','japan'])
s2 = pd.Series([1,2,3,4,],['usa','ger','italy','japan'])

In [157]:
s1

usa      1
ger      2
ussr     3
japan    4
dtype: int64

In [14]:
print(s1,s2)

usa      1
ger      2
ussr     3
japan    4
dtype: int64 usa      1
ger      2
italy    3
japan    4
dtype: int64

In [158]:
s2

usa      1
ger      2
italy    3
japan    4
dtype: int64

In [15]:
s1['usa']

1

In [16]:
s2['italy']

3

In [17]:
# s2['ussr'] #KeyError

In [18]:
s1+s2

ger      4.0
italy    NaN
japan    8.0
usa      2.0
ussr     NaN
dtype: float64

# DATAFrames

In [171]:
from numpy.random import randn

In [188]:
# understanding a seed

In [193]:
np.random.randint(0,100)

52

In [196]:
# getting same random number everytime using a random number generator

In [203]:
np.random.seed(101)
np.random.randint(0,100)

95

In [201]:
np.random.seed(101)
randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [205]:
np.random.seed(100)
randn(5,4)

array([[-1.74976547,  0.3426804 ,  1.1530358 , -0.25243604],
       [ 0.98132079,  0.51421884,  0.22117967, -1.07004333],
       [-0.18949583,  0.25500144, -0.45802699,  0.43516349],
       [-0.58359505,  0.81684707,  0.67272081, -0.10441114],
       [-0.53128038,  1.02973269, -0.43813562, -1.11831825]])

In [206]:
df  =  pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [186]:
df.shape

(5, 4)

In [187]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
# accessing the data in the df
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [25]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [26]:
df['W':'Z']

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [27]:
# creating a new column
df['new1'] = df['W'] + df['W']

In [28]:
df

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  5.413700
B  0.651118 -0.319318 -0.848077  0.605965  1.302236
C -2.018168  0.740122  0.528813 -0.589001 -4.036336
D  0.188695 -0.758872 -0.933237  0.955057  0.377391
E  0.190794  1.978757  2.605967  0.683509  0.381589

In [29]:
# dropping a column
df.drop('new1',axis=1) #not effective only view

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  5.413700
B  0.651118 -0.319318 -0.848077  0.605965  1.302236
C -2.018168  0.740122  0.528813 -0.589001 -4.036336
D  0.188695 -0.758872 -0.933237  0.955057  0.377391
E  0.190794  1.978757  2.605967  0.683509  0.381589

In [31]:
# dropping a column
df.drop('new1',axis=1,inplace=True) #  effective now, permanently

In [32]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
# dropping a row
df.drop('E') # axis= 0 is by default

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [34]:
# Selectin rows

In [35]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [36]:
# index based 
# for accessing row 'C'
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [37]:
# subsets of rows and columns

In [38]:
df.loc['B','Y']

-0.8480769834036315

In [39]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [40]:
# practice

# arr1 = np.arange(20).reshape(5,4)
# df  =  pd.DataFrame(arr1,['A','B','C','D','E'],['W','X','Y','Z'])

In [41]:
# df

# Conditional Selection

In [230]:
df

   A
0  1
1  2
2  3
3  4
4  5

In [43]:
booldf = df > 0

In [44]:
df[booldf] #NaN for False values
# Single step
#  df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df['W'] >0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [231]:
df[df['W'] >0]

KeyError: 'W'

In [47]:
df[df['Z'] <0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [48]:
# extracting data from the conditional selection
# Selecting col X from the conditional selection
df[df['W'] >0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [49]:
df[df['W'] >0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [50]:
# Passing multiple conditions
df[(df['W'] >0) & (df['Y'] >1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df[(df['W'] >0) | (df['Y'] >1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
# resetting index to default
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [53]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
# setting index

In [55]:
newindex = ['P', 'Q', 'R', 'S', 'T']

In [56]:
newindex

['P', 'Q', 'R', 'S', 'T']

In [57]:
df['States'] = newindex

In [58]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826      P
B  0.651118 -0.319318 -0.848077  0.605965      Q
C -2.018168  0.740122  0.528813 -0.589001      R
D  0.188695 -0.758872 -0.933237  0.955057      S
E  0.190794  1.978757  2.605967  0.683509      T

In [59]:
# maing the new column as INDEX
df.set_index('States')

               W         X         Y         Z
States
P       2.706850  0.628133  0.907969  0.503826
Q       0.651118 -0.319318 -0.848077  0.605965
R      -2.018168  0.740122  0.528813 -0.589001
S       0.188695 -0.758872 -0.933237  0.955057
T       0.190794  1.978757  2.605967  0.683509

# Multi Index

In [60]:
# advanced topic for later

In [1]:
import numpy as np
import pandas as pd

# Missing data

In [2]:
d = {'A' : [1,2,np.nan],
    'B' : [1,np.nan,np.nan],
    'C' : [1,2,3],}

In [3]:
df = pd.DataFrame(d)

In [5]:
print(df)

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
# removing na from the goven dataset

In [8]:
df.dropna() # default axis = 0

     A    B  C
0  1.0  1.0  1

In [9]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [10]:
df.dropna(thresh=2) # setting a threshold for preserving the row/coluumn

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2

In [11]:
# filling missing values

In [12]:
df.fillna(value="SOME DATA")

           A          B  C
0        1.0        1.0  1
1        2.0  SOME DATA  2
2  SOME DATA  SOME DATA  3

In [15]:
df['A'].fillna(value=df['A'].mean()) # filing the missing data with measn value

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [45]:
np.array(list("goog goog msft msft fb fb sam char amy vnaess carl Sara 200 12 340 124 243 350".split(" "))).reshape(3,6)

array([['goog', 'goog', 'msft', 'msft', 'fb', 'fb'],
       ['sam', 'char', 'amy', 'vnaess', 'carl', 'Sara'],
       ['200', '12', '340', '124', '243', '350']], dtype='<U6')

In [51]:
# same concept as sql

In [52]:
df  =  pd.DataFrame(np.array(list("goog goog msft msft fb fb sam char amy vnaess carl Sara 200 12 340 124 243 350".split(" "))).reshape(3,6),list(range(0,3)),list('ABCDEF'))

In [53]:
df

      A     B     C       D     E     F
0  goog  goog  msft    msft    fb    fb
1   sam  char   amy  vnaess  carl  Sara
2   200    12   340     124   243   350

In [57]:
data = {'Company' : ['goog', 'goog', 'msft', 'msft', 'fb', 'fb'],
        'Person' :     ['sam', 'char', 'amy', 'vnaess', 'carl', 'Sara'],
        'sales' : ['200', '120', '340', '124', '243', '350']
    
}

In [58]:
df  = pd.DataFrame(data)

In [59]:
df

  Company  Person sales
0    goog     sam   200
1    goog    char   120
2    msft     amy   340
3    msft  vnaess   124
4      fb    carl   243
5      fb    Sara   350

In [61]:
df.groupby('Company')

In [62]:
by_comp = df.groupby('Company')

In [63]:
by_comp.mean()

C:\Users\RAHUL\AppData\Local\Temp\ipykernel_20236\821838057.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.mean()

            sales
Company
fb       121675.0
goog     100060.0
msft     170062.0

In [64]:
by_comp.sum()

            Person   sales
Company
fb        carlSara  243350
goog       samchar  200120
msft     amyvnaess  340124

In [65]:
# all in one liner
df.groupby('Company').sum().loc['fb']

Person    carlSara
sales       243350
Name: fb, dtype: object

In [66]:
df.groupby('Company').count()

         Person  sales
Company
fb            2      2
goog          2      2
msft          2      2

In [67]:
df.groupby('Company').max()

         Person sales
Company
fb         carl   350
goog        sam   200
msft     vnaess   340

In [68]:
df.groupby('Company').min()

        Person sales
Company
fb        Sara   243
goog      char   120
msft       amy   124

In [69]:
df.groupby('Company').describe()

        Person                   sales
         count unique   top freq count unique  top freq
Company
fb           2      2  carl    1     2      2  243    1
goog         2      2   sam    1     2      2  200    1
msft         2      2   amy    1     2      2  340    1

In [70]:
df.groupby('Company').describe().transpose()

Company          fb goog msft
Person count      2    2    2
       unique     2    2    2
       top     carl  sam  amy
       freq       1    1    1
sales  count      2    2    2
       unique     2    2    2
       top      243  200  340
       freq       1    1    1

In [71]:
df.groupby('Company').describe().transpose()['fb']

Person  count        2
        unique       2
        top       carl
        freq         1
sales   count        2
        unique       2
        top        243
        freq         1
Name: fb, dtype: object

# Concatenating

In [72]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [73]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [81]:

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [76]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [77]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [82]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [85]:
pd.concat([df1,df2,df3]) #default axis=0 for concat

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [86]:
# We will be mostly joining along axis=1
pd.concat([df1,df2,df3] , axis=1) #changing default axis=0 for concat to axis=1

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Merging

In [87]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [89]:
pd.concat([left,right], axis=1)

  key   A   B key   C   D
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K2  C2  D2
3  K3  A3  B3  K3  C3  D3

In [97]:
# pd.merge(left,right,how='outer',on='key')

In [92]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [93]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [98]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [99]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [94]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [95]:
pd.merge(left,right,how='inner',on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

# Joininng

In [100]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [101]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [102]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [104]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [105]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

#  Operations

In [392]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

In [393]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [394]:
# finding uniue values

In [396]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [397]:
df['col2'].nunique() #number of uniue

3

In [398]:
df['col2'].value_counts() # frequency of each unique values

444    2
555    1
666    1
Name: col2, dtype: int64

In [399]:
# apply method

In [400]:
df['col2'].sum()

2109

In [401]:
def double(x):
    return 2*x

df['col2'].apply(double)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [ ]:
# apply method using lambda

In [403]:
df['col2'].apply(lambda x : x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [404]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [405]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [406]:
# sorting and ordering/

In [407]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [408]:
# finding null values

In [409]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [411]:
# Piviot table

In [412]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

In [413]:
df = pd.DataFrame(data)

In [414]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [415]:
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Exercise Incomplete

In [106]:
import numpy as np
import pandas as pd

In [125]:
df = pd.read_csv(r"C:\Users\RAHUL\Documents\OnePython\0.SelfStudy\Salaries.csv\Salaries.csv")

C:\Users\RAHUL\AppData\Local\Temp\ipykernel_20236\77962303.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(r"C:\Users\RAHUL\Documents\OnePython\0.SelfStudy\Salaries.csv\Salaries.csv")

In [126]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [127]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

# Exercise 2

In [232]:
import numpy as np
import pandas as pd

In [233]:
df = pd.read_csv(r"sample.csv")

In [234]:
df

   p         q         r         s         t         u
0  a  0.110345  0.653222  0.953931  0.555563  0.895933
1  b  0.561994  0.818332  0.697831  0.272566  0.006735
2  c  0.333848  0.064781  0.678733  0.827482  0.865290
3  d  0.230869  0.137331  0.401443  0.209584  0.949953
4  e  0.322074  0.392513  0.985987  0.206357  0.942567
5  f  0.761031  0.786093  0.106364  0.873725  0.572389

In [239]:
df.shape

(6, 6)

In [240]:
df.ndim

2

In [241]:
df.dtypes

p     object
q    float64
r    float64
s    float64
t    float64
u    float64
dtype: object

In [242]:
# accessig the columns

In [243]:
df['p']

0    a
1    b
2    c
3    d
4    e
5    f
Name: p, dtype: object

In [244]:
df['q']

0    0.110345
1    0.561994
2    0.333848
3    0.230869
4    0.322074
5    0.761031
Name: q, dtype: float64

In [246]:
df[['q','u']]

          q         u
0  0.110345  0.895933
1  0.561994  0.006735
2  0.333848  0.865290
3  0.230869  0.949953
4  0.322074  0.942567
5  0.761031  0.572389

In [249]:
# df['q':'u'] this will not work

In [390]:
#  creating a new column

In [391]:
df

               q         r         s         t         u
States
P       0.110345  0.653222  0.953931  0.555563  0.895933
Q       0.561994  0.818332  0.697831  0.272566  0.006735
R       0.333848  0.064781  0.678733  0.827482  0.865290
S       0.230869  0.137331  0.401443  0.209584  0.949953
T       0.322074  0.392513  0.985987  0.206357  0.942567
U       0.761031  0.786093  0.106364  0.873725  0.572389

In [254]:
df['v'] = np.arange(10,16).reshape(6,1)

In [255]:
df

   p         q         r         s         t         u   v
0  a  0.110345  0.653222  0.953931  0.555563  0.895933  10
1  b  0.561994  0.818332  0.697831  0.272566  0.006735  11
2  c  0.333848  0.064781  0.678733  0.827482  0.865290  12
3  d  0.230869  0.137331  0.401443  0.209584  0.949953  13
4  e  0.322074  0.392513  0.985987  0.206357  0.942567  14
5  f  0.761031  0.786093  0.106364  0.873725  0.572389  15

In [256]:
# removing  a column

In [260]:
df.drop('t', axis=1,)

   p         q         r         s         u   v
0  a  0.110345  0.653222  0.953931  0.895933  10
1  b  0.561994  0.818332  0.697831  0.006735  11
2  c  0.333848  0.064781  0.678733  0.865290  12
3  d  0.230869  0.137331  0.401443  0.949953  13
4  e  0.322074  0.392513  0.985987  0.942567  14
5  f  0.761031  0.786093  0.106364  0.572389  15

In [262]:
df # use inplace=True for effective change

   p         q         r         s         t         u   v
0  a  0.110345  0.653222  0.953931  0.555563  0.895933  10
1  b  0.561994  0.818332  0.697831  0.272566  0.006735  11
2  c  0.333848  0.064781  0.678733  0.827482  0.865290  12
3  d  0.230869  0.137331  0.401443  0.209584  0.949953  13
4  e  0.322074  0.392513  0.985987  0.206357  0.942567  14
5  f  0.761031  0.786093  0.106364  0.873725  0.572389  15

In [263]:
# removing a row

In [267]:
df.drop(4)

   p         q         r         s         t         u   v
0  a  0.110345  0.653222  0.953931  0.555563  0.895933  10
1  b  0.561994  0.818332  0.697831  0.272566  0.006735  11
2  c  0.333848  0.064781  0.678733  0.827482  0.865290  12
3  d  0.230869  0.137331  0.401443  0.209584  0.949953  13
5  f  0.761031  0.786093  0.106364  0.873725  0.572389  15

In [268]:
# selecting row

In [269]:
df.loc[0]

p           a
q    0.110345
r    0.653222
s    0.953931
t    0.555563
u    0.895933
v          10
Name: 0, dtype: object

In [270]:
# index based
df.iloc[0]

p           a
q    0.110345
r    0.653222
s    0.953931
t    0.555563
u    0.895933
v          10
Name: 0, dtype: object

In [271]:
# subsets of tables

In [272]:
df

   p         q         r         s         t         u   v
0  a  0.110345  0.653222  0.953931  0.555563  0.895933  10
1  b  0.561994  0.818332  0.697831  0.272566  0.006735  11
2  c  0.333848  0.064781  0.678733  0.827482  0.865290  12
3  d  0.230869  0.137331  0.401443  0.209584  0.949953  13
4  e  0.322074  0.392513  0.985987  0.206357  0.942567  14
5  f  0.761031  0.786093  0.106364  0.873725  0.572389  15

In [274]:
df.loc[3,'r':]

r    0.137331
s    0.401443
t    0.209584
u    0.949953
v          13
Name: 3, dtype: object

In [284]:
df.loc[[3,5],['r','s','v']] # how to select from a range

          r         s   v
3  0.137331  0.401443  13
5  0.786093  0.106364  15

In [294]:
df.drop('p',axis=1,inplace=True)

In [306]:
df[df>0.5][['u','t']]

          u         t
0  0.895933  0.555563
1       NaN       NaN
2  0.865290  0.827482
3  0.949953       NaN
4  0.942567       NaN
5  0.572389  0.873725

In [307]:
#  ultiple conditions

In [308]:
df

          q         r         s         t         u   v
0  0.110345  0.653222  0.953931  0.555563  0.895933  10
1  0.561994  0.818332  0.697831  0.272566  0.006735  11
2  0.333848  0.064781  0.678733  0.827482  0.865290  12
3  0.230869  0.137331  0.401443  0.209584  0.949953  13
4  0.322074  0.392513  0.985987  0.206357  0.942567  14
5  0.761031  0.786093  0.106364  0.873725  0.572389  15

In [314]:
[(df['s']>0.7) & (df['v']>12)]

[0    False
 1    False
 2    False
 3    False
 4     True
 5    False
 dtype: bool]

In [320]:
df[(df['s']>0.9) & (df['v']>10)]

          q         r         s         t         u   v
4  0.322074  0.392513  0.985987  0.206357  0.942567  14

In [355]:
df

          q         r         s         t         u   v NEW_INDEX
0  0.110345  0.653222  0.953931  0.555563  0.895933  10         A
1  0.561994  0.818332  0.697831  0.272566  0.006735  11         B
2  0.333848  0.064781  0.678733  0.827482  0.865290  12         C
3  0.230869  0.137331  0.401443  0.209584  0.949953  13         D
4  0.322074  0.392513  0.985987  0.206357  0.942567  14         E
5  0.761031  0.786093  0.106364  0.873725  0.572389  15         F

In [356]:
df.reset_index()

   index         q         r         s         t         u   v NEW_INDEX
0      0  0.110345  0.653222  0.953931  0.555563  0.895933  10         A
1      1  0.561994  0.818332  0.697831  0.272566  0.006735  11         B
2      2  0.333848  0.064781  0.678733  0.827482  0.865290  12         C
3      3  0.230869  0.137331  0.401443  0.209584  0.949953  13         D
4      4  0.322074  0.392513  0.985987  0.206357  0.942567  14         E
5      5  0.761031  0.786093  0.106364  0.873725  0.572389  15         F

In [357]:
# setting index

In [361]:
newindex = ['P', 'Q', 'R', 'S', 'T','U']

In [362]:
newindex

['P', 'Q', 'R', 'S', 'T', 'U']

In [363]:
df['States'] = newindex

In [364]:
df

          q         r         s         t         u   v NEW_INDEX States
0  0.110345  0.653222  0.953931  0.555563  0.895933  10         A      P
1  0.561994  0.818332  0.697831  0.272566  0.006735  11         B      Q
2  0.333848  0.064781  0.678733  0.827482  0.865290  12         C      R
3  0.230869  0.137331  0.401443  0.209584  0.949953  13         D      S
4  0.322074  0.392513  0.985987  0.206357  0.942567  14         E      T
5  0.761031  0.786093  0.106364  0.873725  0.572389  15         F      U

In [365]:
df.set_index('States')

TypeError: 'list' object is not callable

In [369]:
df.reset_index(inplace=True)

In [370]:
df

,index,q,r,s,t,u,v,NEW_INDEX,States
0,0,0.110345,0.653222,0.953931,0.555563,0.895933,10,A,P
1,1,0.561994,0.818332,0.697831,0.272566,0.006735,11,B,Q
2,2,0.333848,0.064781,0.678733,0.827482,0.865290,12,C,R
3,3,0.230869,0.137331,0.401443,0.209584,0.949953,13,D,S
4,4,0.322074,0.392513,0.985987,0.206357,0.942567,14,E,T
5,5,0.761031,0.786093,0.106364,0.873725,0.572389,15,F,U

In [371]:
df.set_index('States')

TypeError: 'list' object is not callable

In [381]:
df

          q         r         s         t         u
0  0.110345  0.653222  0.953931  0.555563  0.895933
1  0.561994  0.818332  0.697831  0.272566  0.006735
2  0.333848  0.064781  0.678733  0.827482  0.865290
3  0.230869  0.137331  0.401443  0.209584  0.949953
4  0.322074  0.392513  0.985987  0.206357  0.942567
5  0.761031  0.786093  0.106364  0.873725  0.572389

In [382]:
df = pd.read_csv(r'sample.csv')

In [383]:
df.set_index('u')

                 q         r         s         t
u
0.895933  0.110345  0.653222  0.953931  0.555563
0.006735  0.561994  0.818332  0.697831  0.272566
0.865290  0.333848  0.064781  0.678733  0.827482
0.949953  0.230869  0.137331  0.401443  0.209584
0.942567  0.322074  0.392513  0.985987  0.206357
0.572389  0.761031  0.786093  0.106364  0.873725

In [384]:
df

          q         r         s         t         u
0  0.110345  0.653222  0.953931  0.555563  0.895933
1  0.561994  0.818332  0.697831  0.272566  0.006735
2  0.333848  0.064781  0.678733  0.827482  0.865290
3  0.230869  0.137331  0.401443  0.209584  0.949953
4  0.322074  0.392513  0.985987  0.206357  0.942567
5  0.761031  0.786093  0.106364  0.873725  0.572389

In [385]:
newindex = ['P', 'Q', 'R', 'S', 'T','U']

In [386]:
df['States'] = newindex

In [387]:
df

          q         r         s         t         u States
0  0.110345  0.653222  0.953931  0.555563  0.895933      P
1  0.561994  0.818332  0.697831  0.272566  0.006735      Q
2  0.333848  0.064781  0.678733  0.827482  0.865290      R
3  0.230869  0.137331  0.401443  0.209584  0.949953      S
4  0.322074  0.392513  0.985987  0.206357  0.942567      T
5  0.761031  0.786093  0.106364  0.873725  0.572389      U

In [389]:
df.set_index('States', inplace=True)

# Exercise 3

In [416]:
import numpy as np
import pandas as pd

In [417]:
df = pd.read_csv('sample2.csv')

In [418]:
df

     a   b   c   d   e
0   39  35  47  43  24
1   13  55  50  43  38
2   49  28  10  64  41
3   66  65  40  62  14
4   33  52  30  55  68
5   17  53  16  55  41
6   38  43  19  40  28
7   69  54  59  41  50
8   41  22  13  63  20
9   58  49  35  17  16
10  66  25  52  31  70
11  51  48  10  26  53
12  14  14  11  46  60
13  17  27  22  17  42
14  44  70  59  58  65
15  60  62  19  69  51
16  55  64  41  59  45
17  32  37  17  10  45
18  51  43  36  65  54
19  29  60  35  64  27

In [419]:
df.shape

(20, 5)

In [420]:
df.ndim

2

In [421]:
df.size

100

In [428]:
# accessing the data in the df
df[['a','b','c']]

     a   b   c
0   39  35  47
1   13  55  50
2   49  28  10
3   66  65  40
4   33  52  30
5   17  53  16
6   38  43  19
7   69  54  59
8   41  22  13
9   58  49  35
10  66  25  52
11  51  48  10
12  14  14  11
13  17  27  22
14  44  70  59
15  60  62  19
16  55  64  41
17  32  37  17
18  51  43  36
19  29  60  35

In [429]:
# creating a new column
df['f'] =  2*df['a']

In [430]:
df

     a   b   c   d   e    f
0   39  35  47  43  24   78
1   13  55  50  43  38   26
2   49  28  10  64  41   98
3   66  65  40  62  14  132
4   33  52  30  55  68   66
5   17  53  16  55  41   34
6   38  43  19  40  28   76
7   69  54  59  41  50  138
8   41  22  13  63  20   82
9   58  49  35  17  16  116
10  66  25  52  31  70  132
11  51  48  10  26  53  102
12  14  14  11  46  60   28
13  17  27  22  17  42   34
14  44  70  59  58  65   88
15  60  62  19  69  51  120
16  55  64  41  59  45  110
17  32  37  17  10  45   64
18  51  43  36  65  54  102
19  29  60  35  64  27   58

In [434]:
# dropping a column
df.drop('b',axis=1,inplace=True)

In [435]:
df

     a   c   d   e    f
0   39  47  43  24   78
1   13  50  43  38   26
2   49  10  64  41   98
3   66  40  62  14  132
4   33  30  55  68   66
5   17  16  55  41   34
6   38  19  40  28   76
7   69  59  41  50  138
8   41  13  63  20   82
9   58  35  17  16  116
10  66  52  31  70  132
11  51  10  26  53  102
12  14  11  46  60   28
13  17  22  17  42   34
14  44  59  58  65   88
15  60  19  69  51  120
16  55  41  59  45  110
17  32  17  10  45   64
18  51  36  65  54  102
19  29  35  64  27   58

In [437]:
# dropping a row
df.drop(12)

     a   c   d   e    f
0   39  47  43  24   78
1   13  50  43  38   26
2   49  10  64  41   98
3   66  40  62  14  132
4   33  30  55  68   66
5   17  16  55  41   34
6   38  19  40  28   76
7   69  59  41  50  138
8   41  13  63  20   82
9   58  35  17  16  116
10  66  52  31  70  132
11  51  10  26  53  102
13  17  22  17  42   34
14  44  59  58  65   88
15  60  19  69  51  120
16  55  41  59  45  110
17  32  17  10  45   64
18  51  36  65  54  102
19  29  35  64  27   58

In [438]:
# Selectin rows

In [443]:
df.loc[10]
df.loc[[10, 11]]

     a   c   d   e    f
10  66  52  31  70  132
11  51  10  26  53  102

In [448]:
df[(df['c']>30) & (df['a']>60)]

     a   c   d   e    f
3   66  40  62  14  132
7   69  59  41  50  138
10  66  52  31  70  132

In [449]:
df[(df['c']>30) & (df['a']>60)]['f']

3     132
7     138
10    132
Name: f, dtype: int64

In [450]:
# resetting index to default

In [451]:
df.reset_index()

    index   a   c   d   e    f
0       0  39  47  43  24   78
1       1  13  50  43  38   26
2       2  49  10  64  41   98
3       3  66  40  62  14  132
4       4  33  30  55  68   66
5       5  17  16  55  41   34
6       6  38  19  40  28   76
7       7  69  59  41  50  138
8       8  41  13  63  20   82
9       9  58  35  17  16  116
10     10  66  52  31  70  132
11     11  51  10  26  53  102
12     12  14  11  46  60   28
13     13  17  22  17  42   34
14     14  44  59  58  65   88
15     15  60  19  69  51  120
16     16  55  41  59  45  110
17     17  32  17  10  45   64
18     18  51  36  65  54  102
19     19  29  35  64  27   58

In [452]:
df.set_index('f')

      a   c   d   e
f
78   39  47  43  24
26   13  50  43  38
98   49  10  64  41
132  66  40  62  14
66   33  30  55  68
34   17  16  55  41
76   38  19  40  28
138  69  59  41  50
82   41  13  63  20
116  58  35  17  16
132  66  52  31  70
102  51  10  26  53
28   14  11  46  60
34   17  22  17  42
88   44  59  58  65
120  60  19  69  51
110  55  41  59  45
64   32  17  10  45
102  51  36  65  54
58   29  35  64  27

In [459]:
df.replace(16,'NaN')

     a    c   d    e    f
0   39   47  43   24   78
1   13   50  43   38   26
2   49   10  64   41   98
3   66   40  62   14  132
4   33   30  55   68   66
5   17  NaN  55   41   34
6   38   19  40   28   76
7   69   59  41   50  138
8   41   13  63   20   82
9   58   35  17  NaN  116
10  66   52  31   70  132
11  51   10  26   53  102
12  14   11  46   60   28
13  17   22  17   42   34
14  44   59  58   65   88
15  60   19  69   51  120
16  55   41  59   45  110
17  32   17  10   45   64
18  51   36  65   54  102
19  29   35  64   27   58

In [463]:
df = pd.read_csv('sample2.csv')

In [464]:
df

       a     b     c     d   e
0   39.0  35.0  47.0  43.0  24
1   13.0  55.0  50.0  43.0  38
2   49.0  28.0  10.0   NaN  41
3   66.0  65.0  40.0  62.0  14
4   33.0  52.0  30.0  55.0  68
5   17.0  53.0   NaN  55.0  41
6   38.0  43.0  19.0  40.0  28
7   69.0  54.0  59.0  41.0  50
8    NaN  22.0  13.0  63.0  20
9   58.0  49.0   NaN  17.0  16
10  66.0  25.0  52.0  31.0  70
11  51.0  48.0  10.0  26.0  53
12  14.0  14.0  11.0  46.0  60
13  17.0  27.0  22.0  17.0  42
14  44.0  70.0  59.0   NaN  65
15  60.0  62.0  19.0  69.0  51
16  55.0   NaN  41.0  59.0  45
17  32.0  37.0  17.0   NaN  45
18  51.0  43.0  36.0  65.0  54
19  29.0  60.0  35.0  64.0  27

In [466]:
# removing na from the goven dataset
df.fillna(999)

        a      b      c      d   e
0    39.0   35.0   47.0   43.0  24
1    13.0   55.0   50.0   43.0  38
2    49.0   28.0   10.0  999.0  41
3    66.0   65.0   40.0   62.0  14
4    33.0   52.0   30.0   55.0  68
5    17.0   53.0  999.0   55.0  41
6    38.0   43.0   19.0   40.0  28
7    69.0   54.0   59.0   41.0  50
8   999.0   22.0   13.0   63.0  20
9    58.0   49.0  999.0   17.0  16
10   66.0   25.0   52.0   31.0  70
11   51.0   48.0   10.0   26.0  53
12   14.0   14.0   11.0   46.0  60
13   17.0   27.0   22.0   17.0  42
14   44.0   70.0   59.0  999.0  65
15   60.0   62.0   19.0   69.0  51
16   55.0  999.0   41.0   59.0  45
17   32.0   37.0   17.0  999.0  45
18   51.0   43.0   36.0   65.0  54
19   29.0   60.0   35.0   64.0  27

In [469]:
df.dropna(axis=1)

     e
0   24
1   38
2   41
3   14
4   68
5   41
6   28
7   50
8   20
9   16
10  70
11  53
12  60
13  42
14  65
15  51
16  45
17  45
18  54
19  27

In [471]:
df.dropna(thresh=2)

       a     b     c     d   e
0   39.0  35.0  47.0  43.0  24
1   13.0  55.0  50.0  43.0  38
2   49.0  28.0  10.0   NaN  41
3   66.0  65.0  40.0  62.0  14
4   33.0  52.0  30.0  55.0  68
5   17.0  53.0   NaN  55.0  41
6   38.0  43.0  19.0  40.0  28
7   69.0  54.0  59.0  41.0  50
8    NaN  22.0  13.0  63.0  20
9   58.0  49.0   NaN  17.0  16
10  66.0  25.0  52.0  31.0  70
11  51.0  48.0  10.0  26.0  53
12  14.0  14.0  11.0  46.0  60
13  17.0  27.0  22.0  17.0  42
14  44.0  70.0  59.0   NaN  65
15  60.0  62.0  19.0  69.0  51
16  55.0   NaN  41.0  59.0  45
17  32.0  37.0  17.0   NaN  45
18  51.0  43.0  36.0  65.0  54
19  29.0  60.0  35.0  64.0  27

In [473]:
df['a'].fillna(value=df['a'].mean())

0     39.000000
1     13.000000
2     49.000000
3     66.000000
4     33.000000
5     17.000000
6     38.000000
7     69.000000
8     42.157895
9     58.000000
10    66.000000
11    51.000000
12    14.000000
13    17.000000
14    44.000000
15    60.000000
16    55.000000
17    32.000000
18    51.000000
19    29.000000
Name: a, dtype: float64

In [474]:
df2 = pd.read_csv('sample_group.csv')

In [478]:
df2.drop('Unnamed: 0',axis=1,inplace=True)

In [479]:
df2

     Company  Person  sales
0  Microsoft     sam    200
1  Microsoft    char    120
2     Google     amy    340
3     Google  vnaess    124
4   Facebook    carl    243
5   Facebook    Sara    350

In [482]:
df2.groupby('Company').mean()

C:\Users\RAHUL\AppData\Local\Temp\ipykernel_20236\3569347762.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df2.groupby('Company').mean()

           sales
Company
Facebook   296.5
Google     232.0
Microsoft  160.0

In [483]:
df2.groupby('Company').sum()

C:\Users\RAHUL\AppData\Local\Temp\ipykernel_20236\1708485185.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df2.groupby('Company').sum()

           sales
Company
Facebook     593
Google       464
Microsoft    320

In [485]:
df2.groupby('Company').sum().loc['Facebook']

C:\Users\RAHUL\AppData\Local\Temp\ipykernel_20236\2051811914.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df2.groupby('Company').sum().loc['Facebook']

sales    593
Name: Facebook, dtype: int64

In [486]:
df2.groupby('Company').count()

           Person  sales
Company
Facebook        2      2
Google          2      2
Microsoft       2      2

In [488]:
df2.groupby('Company').max()

           Person  sales
Company
Facebook     carl    350
Google     vnaess    340
Microsoft     sam    200

In [490]:
df2.groupby('Company').describe().transpose()

Company        Facebook      Google   Microsoft
sales count    2.000000    2.000000    2.000000
      mean   296.500000  232.000000  160.000000
      std     75.660426  152.735065   56.568542
      min    243.000000  124.000000  120.000000
      25%    269.750000  178.000000  140.000000
      50%    296.500000  232.000000  160.000000
      75%    323.250000  286.000000  180.000000
      max    350.000000  340.000000  200.000000

In [491]:
df

       a     b     c     d   e
0   39.0  35.0  47.0  43.0  24
1   13.0  55.0  50.0  43.0  38
2   49.0  28.0  10.0   NaN  41
3   66.0  65.0  40.0  62.0  14
4   33.0  52.0  30.0  55.0  68
5   17.0  53.0   NaN  55.0  41
6   38.0  43.0  19.0  40.0  28
7   69.0  54.0  59.0  41.0  50
8    NaN  22.0  13.0  63.0  20
9   58.0  49.0   NaN  17.0  16
10  66.0  25.0  52.0  31.0  70
11  51.0  48.0  10.0  26.0  53
12  14.0  14.0  11.0  46.0  60
13  17.0  27.0  22.0  17.0  42
14  44.0  70.0  59.0   NaN  65
15  60.0  62.0  19.0  69.0  51
16  55.0   NaN  41.0  59.0  45
17  32.0  37.0  17.0   NaN  45
18  51.0  43.0  36.0  65.0  54
19  29.0  60.0  35.0  64.0  27

In [493]:
df.head()

      a     b     c     d   e
0  39.0  35.0  47.0  43.0  24
1  13.0  55.0  50.0  43.0  38
2  49.0  28.0  10.0   NaN  41
3  66.0  65.0  40.0  62.0  14
4  33.0  52.0  30.0  55.0  68

In [494]:
df['a'].unique()

array([39., 13., 49., 66., 33., 17., 38., 69., nan, 58., 51., 14., 44.,
       60., 55., 32., 29.])

#  Exercise SalesForce

In [1]:
import numpy as np
import pandas as pd

In [16]:
sf = pd.read_csv('Salaries.csv',dtype= {3: np.float64})

C:\Users\RAHUL\AppData\Local\Temp\ipykernel_2380\3522337577.py:1: DtypeWarning: Columns (12) have mixed types. Specify dtype option on import or set low_memory=False.
  sf = pd.read_csv('Salaries.csv',dtype= {3: np.float64})

In [17]:
sf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  float64
 4   OvertimePay       148654 non-null  float64
 5   OtherPay          148654 non-null  float64
 6   Benefits          112495 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB

In [7]:
sf = pd.read_csv('Salaries.csv',low_memory=False)

In [8]:
sf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB